# language: uk
Функціонал: Користувач може створювати нові мокапи
  Як користувач,
  я хочк мати можливість створювати нові мокапи.

  Структура сценарію: Мокапи із валідними даними створюютсья
    Припустимо користувач знаходиться на сторінці /
    Коли він вводить "<url>" в поле url
    Та він вводить "<code>" в поле code
    Та він вводить "<message>" в поле message
    Та натискає на кнопку "Create/Update"
    Тоді перевір, що створено мокап із адресою "<url>", повідомленням "<message>" та кодом <code>

    Приклади:
      | url         | code | message |
      | /test       | 200  | ok      |
      | /other/test | 400  | deny    |

  Сценарій: Мокапи із невалідними данними не створюються
    Дано користувач знаходиться на сторінці /
    Коли він вводить "{}" в поле #request
    Та натискає на кнопку "Create/Update"
    Тоді перевір що зявивився текст "400"